package com.zl.newhand;
/**
 * 新手算法学习包
 */
/**
 * 什么是算法:
 *      1. 解决具体问题的具体流程
 *      2. 可评价指标(时间复杂度和额外空间复杂度)
 *          a.时间复杂度
 *              定义: 把算法流程中，所有常数操作列出来，分析出和数据量N的表达式，最高阶项就是时间复杂度。
 *              ii.常数操作:某个操作和数据量没有关系。
 *              jj.常见复杂度: o(1)、o(logN)、o(N)、o(N*logN)、o(N^2)、o(N^3)、o(N^K)、o(2^N)、o(3^N)、o(K^N)、o(N!)
 *          b.额外空间复杂度
 *              定义: 需要开辟一些空间来支持这个算法流程的空间，就叫额外空间复杂度。
 *                    输入参数和输出结果都不算额外空间复杂度。
 *          c.算法最优解
 *              定义: 满足时间复杂度后，空间复杂度相对也最低，就是算法最优解。
 *
 * 算法分类:
 *      1. 知道怎么算的算法。
 *      2. 知道怎么试的算法。
 * 数据结构分类:
 *      物理结构:
 *          1. 紧密结构。
 *          2. 跳跃结构。
 *      逻辑结构:
 *          1.
 *
 * 数学知识:
 *      1.排列组合
 *      2.等差数列
 */