/**
 * 新手算法学习包
 */
/**
 * 什么是算法:
 *      1. 解决具体问题的具体流程
 *      2. 可评价指标(时间复杂度和空间复杂度)
 *          a.时间复杂度
 *              ii.某个操作和数据量没有关系，就叫常数操作。
 *              jj. 常见复杂度: o(1)、o(logN)、o(N)、o(N*logN)、o(N^2)、o(N^3)、o(N^K)、o(2^N)、o(3^N)、o(K^N)、o(N!)
 * 算法分类:
 *      1. 知道怎么算的算法。
 *      2. 知道怎么试的算法。
 * 数据结构分类:
 *      物理结构:
 *          1. 紧密结构。
 *          2. 跳跃结构。
 *      逻辑结构:
 *          1.
 *
 * 位运算:
 * 	左移没有带符号之说，只有右移才区分是否带符号。
 * 	32位整数，有符号和无符号所代表的数的区间范围。 有符号:-2^31 ～ 2^31-1 无符号:0～2^32-1 主要是计算规则。 负值是去除符号位，取反加1。
 * 	与或非 异或
 * 	带符号右移>>  不带符号右移>>>
 * 	正数取反加一等于它的负数(~N+1=-N) 特殊情况 int最小值，取反加一还是int最小值。
 */
package org.example.hand;